Repository: enrzh/aiity
Catalog: AIApp/Localizable.xcstrings
Source language: de
Languages: ar, bn, en, es, fr, hi, id, it, ja, ko, pt, ru, tr, ur, vi, zh_hans

source: Die Adressen sind nicht symbolisiert — ein Signal-Handler darf nichts allozieren. Der Systembericht unten liefert dieselben Frames mit Namen, sobald iOS ihn ausliefert.
ar: العناوين غير مُحوَّلة إلى أسماء — معالِج الإشارة لا يجوز له حجز ذاكرة. تقرير النظام بالأسفل يعرض نفس الإطارات بأسمائها بمجرّد أن يوفّره iOS.
bn: ঠিকানাগুলো সিম্বলাইজ করা হয়নি — সিগন্যাল-হ্যান্ডলার কিছু বরাদ্দ করতে পারে না। নিচের সিস্টেম রিপোর্টে iOS দেওয়ার সাথে সাথে একই ফ্রেম নাম সহ পাওয়া যাবে।
en: The addresses aren't symbolicated — a signal handler must not allocate. The system report below gives you the same frames with names, as soon as iOS delivers it.
es: Las direcciones no están simbolizadas — un manejador de señales no puede reservar memoria. El informe del sistema de abajo trae los mismos frames con nombre en cuanto iOS lo entrega.
fr: Les adresses ne sont pas symbolisées — un gestionnaire de signal n'a pas le droit d'allouer. Le rapport système ci-dessous donne les mêmes frames avec les noms, dès qu'iOS le fournit.
hi: पते सिंबलीकृत नहीं हैं — सिग्नल हैंडलर कुछ भी आबंटित नहीं कर सकता। नीचे की सिस्टम रिपोर्ट, iOS द्वारा देने पर वही फ़्रेम नामों के साथ देती है।
id: Alamat belum disimbolkan — signal handler tidak boleh mengalokasikan apa pun. Laporan sistem di bawah akan memberikan frame yang sama dengan nama begitu iOS menyediakannya.
it: Gli indirizzi non sono simbolizzati — un signal handler non può allocare memoria. Il report di sistema qui sotto mostra gli stessi frame con i nomi, appena iOS lo fornisce.
ja: アドレスはシンボル化されていません — シグナルハンドラの中ではメモリを確保できないため。下のシステムレポートが届けば、同じフレームが名前付きで見られるよ。
ko: 주소가 심볼화되지 않았습니다 — 시그널 핸들러는 어떤 것도 할당할 수 없습니다. 아래 시스템 보고서는 iOS가 제공하는 즉시 동일한 프레임을 이름과 함께 제공합니다.
pt: Os endereços não estão simbolizados — um signal handler não pode alocar memória. O relatório do sistema abaixo traz os mesmos frames com nomes, assim que o iOS o disponibilizar.
ru: Адреса не символизированы — обработчик сигнала не может выделять память. Системный отчёт ниже покажет те же фреймы с именами, как только iOS его выдаст.
tr: Adresler sembolleştirilmemiş — sinyal işleyicisi hiçbir şey ayıramaz. Aşağıdaki sistem raporu, iOS onu sağlar sağlamaz aynı çerçeveleri isimlerle verecek.
ur: پتے سمبلائزڈ نہیں ہیں — سگنل ہینڈلر کچھ allocate نہیں کر سکتا۔ نیچے دی گئی سسٹم رپورٹ iOS کے فراہم کرتے ہی وہی فریمز نام کے ساتھ دے گی۔
vi: Các địa chỉ chưa được ký hiệu hóa — signal handler không được cấp phát bất cứ thứ gì. Báo cáo hệ thống bên dưới sẽ cung cấp cùng các khung với tên ngay khi iOS gửi nó.
zh_hans: 这些地址没有符号化 — 信号处理程序里不能分配内存。等 iOS 生成系统报告后，下面会显示同样的调用帧并带上名称。

source: Die App wurde regulär beendet oder in den Hintergrund geschickt.
ar: أُغلق التطبيق بشكل طبيعي أو أُرسل إلى الخلفية.
bn: অ্যাপটি স্বাভাবিকভাবে বন্ধ হয়েছে বা ব্যাকগ্রাউন্ডে পাঠানো হয়েছে।
en: The app was closed normally or sent to the background.
es: La app se cerró con normalidad o pasó a segundo plano.
fr: L'app a été fermée normalement ou mise en arrière-plan.
hi: ऐप सामान्य रूप से बंद हुआ या बैकग्राउंड में भेजा गया।
id: Aplikasi ditutup secara normal atau dikirim ke latar belakang.
it: L'app è stata chiusa normalmente o mandata in background.
ja: アプリは正常に終了したか、バックグラウンドに移りました。
ko: 앱이 정상적으로 종료되었거나 백그라운드로 전환되었습니다.
pt: A app foi fechada normalmente ou enviada para segundo plano.
ru: Приложение было закрыто штатно или свёрнуто в фон.
tr: Uygulama normal şekilde kapatıldı veya arka plana gönderildi.
ur: ایپ معمول کے مطابق بند ہوئی یا بیک گراؤنڈ میں بھیجی گئی۔
vi: Ứng dụng đã kết thúc bình thường hoặc được đưa vào nền.
zh_hans: 应用是正常退出，或被切到了后台。

source: Die App „%@“ möchte %@ (%@). Sie kann dabei auch Daten an fremde Server senden. Nur erlauben, wenn du dieser App vertraust.
ar: التطبيق «%@» يريد %@ (%@). قد يُرسل بذلك بيانات إلى خوادم خارجية. لا تسمح إلا إذا كنت تثق بهذا التطبيق.
bn: “%@” অ্যাপটি %@ (%@) করতে চায়। এটি বাইরের সার্ভারেও ডেটা পাঠাতে পারে। শুধুমাত্র এই অ্যাপে বিশ্বাস থাকলে অনুমতি দিন।
en: The app “%@” wants to %@ (%@). It can also send data to third-party servers. Only allow this if you trust this app.
es: La app «%@» quiere %@ (%@). También puede enviar datos a servidores ajenos. Permítelo solo si confías en esta app.
fr: L'app « %@ » veut %@ (%@). Elle peut aussi envoyer des données à des serveurs tiers. N'autorise que si tu fais confiance à cette app.
hi: “%@” ऐप %@ (%@) करना चाहता है। इसमें यह डेटा किसी बाहरी सर्वर को भी भेज सकता है। सिर्फ़ तभी अनुमति दें जब आपको इस ऐप पर भरोसा हो।
id: Aplikasi “%@” ingin %@ (%@). Ini juga dapat mengirim data ke server pihak ketiga. Izinkan hanya jika Anda percaya pada aplikasi ini.
it: L'app «%@» vuole %@ (%@). Può anche inviare dati a server esterni. Consenti solo se ti fidi di questa app.
ja: App「%@」が %@（%@）を求めています。その際に外部のサーバーへデータを送信することもあります。このアプリを信頼できる場合のみ許可してください。
ko: “%@” 앱이 %@ (%@)을(를) 하려고 합니다. 이 과정에서 외부 서버로 데이터를 전송할 수도 있습니다. 이 앱을 신뢰할 때만 허용하세요.
pt: A app «%@» quer %@ (%@). Ao fazê-lo, também pode enviar dados para servidores externos. Só permite se confiares nesta app.
ru: Приложение «%@» запрашивает %@ (%@). При этом оно может отправлять данные на чужие серверы. Разрешай, только если доверяешь этому приложению.
tr: “%@” uygulaması %@ (%@) yapmak istiyor. Bu sırada yabancı sunuculara veri de gönderebilir. Yalnızca bu uygulamaya güveniyorsanız izin verin.
ur: ایپ “%@” %@ (%@) کرنا چاہتی ہے۔ یہ اجنبی سرورز کو بھی ڈیٹا بھیج سکتی ہے۔ صرف اسی صورت اجازت دیں اگر آپ اس ایپ پر اعتماد کرتے ہیں۔
vi: Ứng dụng “%@” muốn %@ (%@). Điều này cũng có thể gửi dữ liệu đến server bên ngoài. Chỉ cho phép nếu bạn tin tưởng ứng dụng này.
zh_hans: 应用「%@」想要 %@（%@）。它也可能因此把数据发送到外部服务器。只有信任这个应用时才允许。

source: Die Datei konnte nicht gelesen werden.
ar: تعذّرت قراءة الملف.
bn: ফাইলটি পড়া যায়নি।
en: The file couldn't be read.
es: No se pudo leer el archivo.
fr: Le fichier n'a pas pu être lu.
hi: फ़ाइल पढ़ी नहीं जा सकी।
id: File tidak dapat dibaca.
it: Impossibile leggere il file.
ja: ファイルを読み込めませんでした。
ko: 파일을 읽을 수 없습니다.
pt: Não foi possível ler o ficheiro.
ru: Файл не удалось прочитать.
tr: Dosya okunamadı.
ur: فائل پڑھی نہیں جا سکی۔
vi: Không thể đọc tệp.
zh_hans: 无法读取该文件。

source: Die Liste kommt aus dem Cache; „Aktualisieren“ holt sie live vom Anbieter.
ar: القائمة مأخوذة من الذاكرة المؤقتة؛ «تحديث» يجلبها مباشرة من المزوّد.
bn: তালিকাটি ক্যাশ থেকে এসেছে; “Aktualisieren” প্রোভাইডার থেকে লাইভ আনবে।
en: This list comes from the cache; “Refresh” fetches it live from the provider.
es: La lista viene de la caché; «Actualizar» la trae en directo del proveedor.
fr: La liste vient du cache ; « Actualiser » la récupère en direct chez le fournisseur.
hi: सूची कैश से आती है; “अपडेट करें” इसे सीधे प्रोवाइडर से लाता है।
id: Daftar berasal dari cache; “Aktualisieren” mengambilnya langsung dari penyedia.
it: La lista viene dalla cache; con “Aggiorna” la scarichi dal provider in tempo reale.
ja: 一覧はキャッシュから表示。「更新」でプロバイダから最新を取得。
ko: 목록은 캐시에서 가져옵니다; “Aktualisieren”은 제공자로부터 실시간으로 가져옵니다.
pt: A lista vem da cache; «Atualizar» vai buscá-la diretamente ao fornecedor.
ru: Список из кэша; «Обновить» запросит актуальный у провайдера.
tr: Liste önbellekten gelir; “Aktualisieren” sağlayıcıdan canlı olarak getirir.
ur: فہرست کیش سے آتی ہے؛ “Aktualisieren” اسے فراہم کنندہ سے لائیو حاصل کرتا ہے۔
vi: Danh sách đến từ bộ nhớ đệm; “Aktualisieren” sẽ lấy trực tiếp từ nhà cung cấp.
zh_hans: 列表来自缓存；点“刷新”会从服务商实时获取。

source: Diese ID verwenden
ar: استخدام هذا المعرّف
bn: এই ID ব্যবহার করুন
en: Use this ID
es: Usar esta ID
fr: Utiliser cette ID
hi: यह ID इस्तेमाल करें
id: Gunakan ID ini
it: Usa questo ID
ja: この ID を使う
ko: 이 ID 사용
pt: Usar este ID
ru: Использовать этот ID
tr: Bu ID'yi kullan
ur: یہ ID استعمال کریں
vi: Dùng ID này
zh_hans: 使用这个 ID

source: Diese Runde spricht nur mit den ersten %lld Agenten der Gruppe.
ar: تقتصر هذه الجولة على أول %lld من وكلاء المجموعة.
bn: এই রাউন্ড শুধু গ্রুপের প্রথম %lld জন Agent-এর সাথে কথা বলবে।
en: This round only talks to the first %lld agents in the group.
es: Esta ronda solo habla con los primeros %lld agentes del grupo.
fr: Ce tour ne s'adresse qu'aux %lld premiers agents du groupe.
hi: यह राउंड ग्रुप के पहले %lld Agents से ही बात करता है।
id: Ronde ini hanya berbicara dengan %lld Agent pertama dalam grup.
it: Questo giro parla solo con i primi %lld agenti del gruppo.
ja: このラウンドはグループの先頭 %lld エージェントとだけやりとりします。
ko: 이번 라운드는 그룹의 처음 %lld개 Agent와만 대화합니다.
pt: Esta ronda fala só com os primeiros %lld agentes do grupo.
ru: Этот раунд обращается только к первым %lld агентам группы.
tr: Bu tur yalnızca gruptaki ilk %lld Agent ile konuşur.
ur: یہ راؤنڈ صرف گروپ کے پہلے %lld Agents سے بات کرے گا۔
vi: Vòng này chỉ nói chuyện với %lld Agent đầu tiên trong nhóm.
zh_hans: 本轮只与群组中的前 %lld 个智能体对话。

source: Diesen Namen gibt es schon. Namen müssen eindeutig sein — der Chat spricht Agenten über den Namen an.
ar: هذا الاسم مستخدم بالفعل. يجب أن تكون الأسماء فريدة — فالدردشة تنادي الوكلاء بأسمائهم.
bn: এই নাম আগে থেকেই আছে। নাম অবশ্যই ইউনিক হতে হবে — চ্যাট নাম দিয়ে Agent-দের ডাকে।
en: That name is taken. Names have to be unique — the chat addresses agents by name.
es: Ese nombre ya existe. Los nombres deben ser únicos: el chat se dirige a los agentes por su nombre.
fr: Ce nom existe déjà. Les noms doivent être uniques — le chat s'adresse aux agents par leur nom.
hi: यह नाम पहले से मौजूद है। नाम अलग-अलग होने चाहिए — चैट Agents को नाम से ही बुलाता है।
id: Nama ini sudah ada. Nama harus unik — chat memanggil Agent berdasarkan nama.
it: Questo nome esiste già. I nomi devono essere univoci — la chat richiama gli agenti per nome.
ja: この名前はすでに使われています。名前は重複できません — チャットは名前でエージェントを呼び出します。
ko: 이 이름은 이미 존재합니다. 이름은 고유해야 합니다 — 채팅은 이름으로 Agent를 부릅니다.
pt: Este nome já existe. Os nomes têm de ser únicos — o chat trata os agentes pelo nome.
ru: Такое имя уже есть. Имена должны быть уникальными — чат обращается к агентам по имени.
tr: Bu isim zaten var. İsimler benzersiz olmalı — sohbet Agent'lara isimle hitap eder.
ur: یہ نام پہلے سے موجود ہے۔ نام منفرد ہونے چاہئیں — چیٹ نام سے Agents کو مخاطب کرتی ہے۔
vi: Tên này đã tồn tại. Tên phải là duy nhất — trò chuyện gọi Agent theo tên.
zh_hans: 这个名字已经有了。名字必须唯一 — 聊天要靠名字来点名智能体。

source: Dieses Modell
ar: هذا النموذج
bn: এই মডেল
en: This model
es: Este modelo
fr: Ce modèle
hi: यह मॉडल
id: Model ini
it: Questo modello
ja: このモデル
ko: 이 모델
pt: Este modelo
ru: Эта модель
tr: Bu model
ur: یہ ماڈل
vi: Mô hình này
zh_hans: 此模型

source: Dieses Modell unterstützt keine Tool-Calls. Die App versucht es ohne Tools erneut…
ar: هذا النموذج لا يدعم استدعاء الأدوات. يعيد التطبيق المحاولة بدون أدوات…
bn: এই মডেল Tool-Calls সাপোর্ট করে না। অ্যাপ টুল ছাড়া আবার চেষ্টা করছে…
en: This model doesn't support tool calls. Retrying without tools…
es: Este modelo no admite llamadas a herramientas. La app lo intenta de nuevo sin herramientas…
fr: Ce modèle ne gère pas les appels d'outils. L'app réessaie sans outils…
hi: यह मॉडल Tool-Calls सपोर्ट नहीं करता। ऐप बिना टूल्स के फिर से कोशिश कर रहा है…
id: Model ini tidak mendukung Tool-Calls. Aplikasi mencoba lagi tanpa tool…
it: Questo modello non supporta i tool call. L'app riprova senza strumenti…
ja: このモデルはツール呼び出しに対応していません。ツールなしで再試行します…
ko: 이 모델은 Tool-Calls를 지원하지 않습니다. 앱이 도구 없이 다시 시도합니다…
pt: Este modelo não suporta chamadas de ferramentas. A app vai tentar de novo sem ferramentas…
ru: Эта модель не поддерживает вызов инструментов. Приложение пробует ещё раз без них…
tr: Bu model Tool-Calls'ı desteklemiyor. Uygulama araçlar olmadan tekrar deniyor…
ur: یہ ماڈل Tool-Calls کو سپورٹ نہیں کرتا۔ ایپ بغیر ٹولز کے دوبارہ کوشش کر رہی ہے…
vi: Mô hình này không hỗ trợ Tool-Calls. Ứng dụng đang thử lại không có công cụ…
zh_hans: 该模型不支持工具调用。应用正在不带工具重试…

source: Dieses iPhone hat %@ und gibt einer App davon ~%@. Modelle, die mehr brauchen, lassen sich nicht laden.
ar: يحتوي هذا iPhone على %@، ويمنح التطبيق منها ~%@ فقط. النماذج التي تحتاج أكثر من ذلك لا يمكن تحميلها.
bn: এই iPhone-এ %@ আছে এবং তার মধ্যে একটি অ্যাপ পায় ~%@। যেসব মডেলের এর বেশি দরকার, সেগুলো লোড করা যায় না।
en: This iPhone has %@ and gives an app ~%@ of that. Models that need more can’t be loaded.
es: Este iPhone tiene %@ y de eso da a una app ~%@. Los modelos que necesitan más no se pueden cargar.
fr: Cet iPhone a %@ et n’en donne à une app que ~%@. Les modèles qui en demandent plus ne peuvent pas être chargés.
hi: इस iPhone में %@ है और उसमें से किसी ऐप को ~%@ ही मिलता है। जिन मॉडलों को इससे ज़्यादा चाहिए, वे लोड नहीं हो सकते।
id: iPhone ini punya %@ dan hanya memberi satu aplikasi ~%@ dari jumlah itu. Model yang butuh lebih banyak tidak bisa dimuat.
it: Questo iPhone ha %@ e a un’app ne dà ~%@. I modelli che ne richiedono di più non possono essere caricati.
ja: この iPhone のメモリは %@ で、アプリに渡せるのはそのうち約 %@ です。それ以上必要なモデルは読み込めません。
ko: 이 iPhone은 %@이고, 그중 앱에 주는 용량은 약 %@입니다. 더 많이 필요한 모델은 불러올 수 없습니다.
pt: Este iPhone tem %@ e dá a um app ~%@ disso. Modelos que precisam de mais não podem ser carregados.
ru: У этого iPhone %@, и приложению из них достаётся ~%@. Модели, которым нужно больше, загрузить нельзя.
tr: Bu iPhone’da %@ var ve bunun ~%@ kadarını bir uygulamaya verir. Daha fazlasını gerektiren modeller yüklenemez.
ur: اس iPhone میں %@ ہے اور اس میں سے ایک ایپ کو صرف ~%@ ملتا ہے۔ جن ماڈلز کو اس سے زیادہ چاہیے، وہ لوڈ نہیں ہو سکتے۔
vi: iPhone này có %@ và chỉ cấp cho một ứng dụng ~%@ trong số đó. Các mô hình cần nhiều hơn sẽ không tải được.
zh_hans: 这台 iPhone 有 %@，其中只能给一个 App 约 %@。需要更多内存的模型无法加载。

source: Download fehlgeschlagen: %@. Großes Modell? Speicher/RAM prüfen — Download trotzdem möglich wenn genug freier Platz.
ar: فشل التنزيل: %@. نموذج كبير؟ تحقّق من مساحة التخزين والذاكرة — التنزيل ممكن رغم ذلك إن توفّرت مساحة كافية.
bn: ডাউনলোড ব্যর্থ হয়েছে: %@। বড় মডেল? মেমরি/RAM যাচাই করুন — যথেষ্ট জায়গা থাকলে ডাউনলোড তবু সম্ভব।
en: Download failed: %@. Large model? Check storage/RAM — the download still works if there's enough free space.
es: Descarga fallida: %@. ¿Modelo grande? Comprueba el almacenamiento/RAM — la descarga sigue siendo posible si hay espacio libre suficiente.
fr: Échec du téléchargement : %@. Modèle volumineux ? Vérifie le stockage/la RAM — le téléchargement reste possible s'il y a assez d'espace libre.
hi: डाउनलोड विफल रहा: %@। बड़ा मॉडल है? स्टोरेज/RAM जाँचें — पर्याप्त जगह होने पर डाउनलोड फिर भी हो सकता है।
id: Unduhan gagal: %@. Model besar? Periksa penyimpanan/RAM — unduhan tetap mungkin jika ruang cukup.
it: Download non riuscito: %@. Modello grande? Controlla spazio/RAM — il download è comunque possibile se c'è abbastanza spazio libero.
ja: ダウンロードに失敗しました: %@。大きなモデルですか？ストレージ/RAM を確認してください — 空き容量が十分ならダウンロードは可能です。
ko: 다운로드 실패: %@. 큰 모델인가요? 저장 공간/RAM을 확인하세요 — 충분한 여유 공간이 있으면 다운로드가 가능할 수 있습니다.
pt: Falha na transferência: %@. Modelo grande? Verifica o armazenamento/RAM — a transferência continua a ser possível se houver espaço livre suficiente.
ru: Загрузка не удалась: %@. Модель большая? Проверь память/ОЗУ — при достаточном свободном месте загрузка всё же возможна.
tr: İndirme başarısız: %@. Büyük model mi? Depolama/RAM kontrol edin — yeterli boş alan varsa indirme yine de mümkündür.
ur: ڈاؤن لوڈ ناکام ہوا: %@۔ بڑا ماڈل؟ میموری/RAM چیک کریں — کافی جگہ ہونے پر ڈاؤن لوڈ پھر بھی ممکن ہے۔
vi: Tải xuống thất bại: %@. Mô hình lớn? Kiểm tra bộ nhớ/RAM — vẫn có thể tải nếu đủ dung lượng trống.
zh_hans: 下载失败：%@。模型太大？检查存储空间/内存 — 只要剩余空间够，仍然可以下载。

source: Du bearbeitest **%@**. Der aktuelle Quellcode ist an die KI übergeben — beschreib nur, was ich ändern oder verbessern soll (Design, Features, Icon, Netzwerk …).
ar: أنت تحرّر **%@**. تم تمرير الشيفرة المصدرية الحالية إلى الذكاء الاصطناعي — اكتفِ بوصف ما أُغيّره أو أُحسّنه (التصميم، الميزات، الأيقونة، الشبكة …).
bn: আপনি **%@** সম্পাদনা করছেন। বর্তমান সোর্স কোড AI-কে দেওয়া হয়েছে — শুধু বলুন কী বদলাতে বা উন্নত করতে হবে (ডিজাইন, ফিচার, আইকন, নেটওয়ার্ক…)।
en: You're editing **%@**. The current source code has been handed to the AI — just describe what I should change or improve (design, features, icon, network …).
es: Estás editando **%@**. El código fuente actual ya está en manos de la IA — solo describe qué debo cambiar o mejorar (diseño, funciones, icono, red …).
fr: Tu modifies **%@**. Le code source actuel a été transmis à l'IA — décris simplement ce que je dois changer ou améliorer (design, fonctionnalités, icône, réseau …).
hi: आप **%@** बदल रहे हैं। मौजूदा सोर्स कोड AI को दे दिया गया है — बस बताएँ कि मुझे क्या बदलना या बेहतर करना है (डिज़ाइन, फ़ीचर्स, आइकन, नेटवर्क …)।
id: Anda sedang mengedit **%@**. Kode sumber saat ini telah diberikan ke AI — cukup jelaskan apa yang harus diubah atau ditingkatkan (desain, fitur, ikon, jaringan…).
it: Stai modificando **%@**. Il codice sorgente attuale è stato passato all'IA — descrivi solo cosa devo cambiare o migliorare (design, funzioni, icona, rete …).
ja: **%@** を編集中です。現在のソースコードはAIに渡してあります — 何を変更・改善してほしいか（デザイン、機能、アイコン、ネットワーク …）だけ伝えてね。
ko: **%@**을(를) 편집 중입니다. 현재 소스 코드가 AI에 전달되었습니다 — 무엇을 변경하거나 개선해야 하는지만 설명하세요 (디자인, 기능, 아이콘, 네트워크…).
pt: Estás a editar **%@**. O código-fonte atual já foi entregue à IA — descreve só o que queres que eu altere ou melhore (design, funcionalidades, ícone, rede …).
ru: Ты редактируешь **%@**. Текущий исходный код передан ИИ — просто опиши, что мне изменить или улучшить (дизайн, функции, иконку, сеть …).
tr: **%@**'yi düzenliyorsunuz. Mevcut kaynak kodu AI'ya verildi — sadece neyi değiştirmem veya geliştirmem gerektiğini açıklayın (tasarım, özellikler, simge, ağ…).
ur: آپ **%@** میں ترمیم کر رہے ہیں۔ موجودہ سورس کوڈ AI کو دیا جا چکا ہے — صرف بتائیں کیا بدلنا یا بہتر کرنا ہے (ڈیزائن، فیچرز، آئیکن، نیٹ ورک…)۔
vi: Bạn đang chỉnh sửa **%@**. Mã nguồn hiện tại đã được chuyển cho AI — chỉ cần mô tả điều cần thay đổi hoặc cải thiện (thiết kế, tính năng, icon, mạng…).
zh_hans: 你正在编辑 **%@**。当前源代码已交给 AI — 你只需描述我该修改或改进什么（设计、功能、图标、网络 …）。

source: DuckDuckGo braucht keinen Key und ist die Standardquelle.
ar: DuckDuckGo لا يحتاج مفتاحًا وهو المصدر الافتراضي.
bn: DuckDuckGo-তে কোনো Key লাগে না এবং এটি ডিফল্ট উৎস।
en: DuckDuckGo needs no key and is the default source.
es: DuckDuckGo no necesita clave y es la fuente por defecto.
fr: DuckDuckGo ne demande aucune clé et sert de source par défaut.
hi: DuckDuckGo को किसी Key की ज़रूरत नहीं और यह डिफ़ॉल्ट स्रोत है।
id: DuckDuckGo tidak memerlukan Key dan merupakan sumber default.
it: DuckDuckGo non richiede una chiave ed è la fonte predefinita.
ja: DuckDuckGo はキー不要で、標準の検索ソースです。
ko: DuckDuckGo는 Key가 필요 없으며 기본 소스입니다.
pt: O DuckDuckGo não precisa de chave e é a fonte predefinida.
ru: DuckDuckGo не требует ключа и используется по умолчанию.
tr: DuckDuckGo bir Key gerektirmez ve varsayılan kaynaktır.
ur: DuckDuckGo کو کسی Key کی ضرورت نہیں اور یہ ڈیفالٹ ذریعہ ہے۔
vi: DuckDuckGo không cần Key và là nguồn mặc định.
zh_hans: DuckDuckGo 不需要 Key，是默认的搜索源。

source: Eigene Modell-ID
ar: معرّف نموذج مخصّص
bn: নিজস্ব মডেল ID
en: Custom model ID
es: ID de modelo propia
fr: ID de modèle perso
hi: अपनी मॉडल-ID
id: ID model sendiri
it: ID modello personalizzato
ja: モデル ID を直接入力
ko: 직접 입력한 모델 ID
pt: ID de modelo personalizado
ru: Свой ID модели
tr: Kendi model ID'si
ur: اپنی ماڈل ID
vi: ID mô hình riêng
zh_hans: 自定义模型 ID

source: Eigenen Agent anlegen
ar: أنشئ وكيلك الخاص
bn: নিজস্ব Agent তৈরি করুন
en: Create your own agent
es: Crear agente propio
fr: Créer un agent
hi: अपना Agent बनाएँ
id: Buat Agent sendiri
it: Crea un agente
ja: エージェントを作る
ko: 나만의 Agent 생성
pt: Criar o teu agente
ru: Создать своего агента
tr: Kendi Agent'ını oluştur
ur: اپنا Agent بنائیں
vi: Tạo Agent riêng
zh_hans: 新建自定义智能体

source: Eigenes Emoji
ar: إيموجي مخصّص
bn: নিজস্ব ইমোজি
en: Custom emoji
es: Emoji propio
fr: Emoji perso
hi: अपना इमोजी
id: Emoji sendiri
it: Emoji personalizzata
ja: 絵文字を入力
ko: 직접 선택한 이모지
pt: Emoji próprio
ru: Своё эмодзи
tr: Kendi emojin
ur: اپنا ایموجی
vi: Emoji riêng
zh_hans: 自定义 Emoji

source: Ein Agent darf ein ganz anderes Modell nutzen als der Chat — z. B. ein günstiges für Fleißarbeit und ein starkes fürs Gegenlesen.
ar: يمكن للوكيل أن يستخدم نموذجاً مختلفاً تماماً عن الدردشة — مثلاً نموذج رخيص للأعمال الروتينية وآخر قوي للمراجعة.
bn: একজন Agent চ্যাটের চেয়ে সম্পূর্ণ ভিন্ন মডেল ব্যবহার করতে পারে — যেমন সাধারণ কাজের জন্য সস্তা, প্রুফরিডিংয়ের জন্য শক্তিশালী।
en: An agent can use a completely different model than the chat — say a cheap one for grunt work and a strong one for proofreading.
es: Un agente puede usar un modelo muy distinto al del chat: por ejemplo, uno barato para el trabajo rutinario y uno potente para revisar.
fr: Un agent peut utiliser un tout autre modèle que le chat — p. ex. un modèle bon marché pour les tâches répétitives et un modèle puissant pour la relecture.
hi: Agent चैट से बिलकुल अलग मॉडल इस्तेमाल कर सकता है — जैसे मेहनत वाले काम के लिए सस्ता और जाँचने के लिए मज़बूत मॉडल।
id: Agent boleh menggunakan model yang sama sekali berbeda dari chat — mis. yang murah untuk kerja rutin dan yang kuat untuk proofreading.
it: Un agente può usare un modello completamente diverso da quello della chat — es. uno economico per il lavoro di routine e uno potente per la rilettura.
ja: エージェントにはチャットとまったく別のモデルを使えます — 単純作業は安いモデル、チェックは強力なモデル、といった具合に。
ko: Agent는 채팅과 완전히 다른 모델을 사용할 수 있습니다 — 예를 들어 반복 작업에는 저렴한 모델을, 검토에는 강력한 모델을.
pt: Um agente pode usar um modelo completamente diferente do chat — por exemplo, um barato para o trabalho repetitivo e um forte para rever.
ru: У агента может быть совсем другая модель, чем у чата — например дешёвая для рутины и сильная для вычитки.
tr: Bir Agent, sohbetten tamamen farklı bir model kullanabilir — örn. rutin işler için ucuz bir model ve gözden geçirme için güçlü bir model.
ur: ایک Agent چیٹ سے بالکل مختلف ماڈل استعمال کر سکتا ہے — مثلاً عام کام کے لیے سستا اور نظرثانی کے لیے مضبوط۔
vi: Một Agent có thể dùng mô hình hoàn toàn khác với trò chuyện — vd. một mô hình rẻ cho việc thường xuyên và một mô hình mạnh để kiểm tra lại.
zh_hans: 智能体可以用和聊天完全不同的模型 — 比如用便宜的干体力活，用强的做复核。

source: Ein Prozess kann das im Nachhinein nicht sicher unterscheiden. Möglich sind:
ar: لا يمكن لأي عملية أن تميّز ذلك لاحقاً بثقة. الاحتمالات:
bn: একটি প্রসেস পরে এটি নিশ্চিতভাবে আলাদা করতে পারে না। সম্ভাব্য কারণ:
en: A process can't tell these apart after the fact. The possibilities:
es: Un proceso no puede distinguirlo con certeza a posteriori. Las posibilidades son:
fr: Un processus ne peut pas faire la différence après coup de façon sûre. Possibilités :
hi: प्रोसेस बाद में इसे पक्के तौर पर अलग नहीं बता सकता। संभावनाएँ हैं:
id: Sebuah proses tidak dapat membedakannya secara pasti setelah kejadian. Kemungkinan:
it: Un processo non può distinguerlo con certezza a posteriori. Le possibilità sono:
ja: プロセス側から後になって確実に見分けることはできません。考えられるのは:
ko: 프로세스는 사후에 이를 확실히 구분할 수 없습니다. 가능한 원인:
pt: Depois do facto, um processo não consegue distinguir isto com certeza. As hipóteses são:
ru: Задним числом процесс не может это надёжно различить. Возможные причины:
tr: Bir süreç bunu sonradan kesin olarak ayırt edemez. Olası nedenler:
ur: ایک پراسیس بعد میں یقینی طور پر یہ فرق نہیں کر سکتا۔ ممکنہ وجوہات:
vi: Một tiến trình không thể phân biệt chắc chắn điều này sau sự việc. Các khả năng:
zh_hans: 进程事后无法可靠地区分这些情况。可能的原因：

source: Ein günstiges, schnelles Modell genügt.
ar: يكفي نموذج رخيص وسريع.
bn: একটি সস্তা, দ্রুত মডেলই যথেষ্ট।
en: A cheap, fast model is plenty.
es: Basta con un modelo barato y rápido.
fr: Un modèle rapide et bon marché suffit.
hi: एक सस्ता, तेज़ मॉडल काफ़ी है।
id: Model yang murah dan cepat sudah cukup.
it: Basta un modello economico e veloce.
ja: 安くて速いモデルで十分です。
ko: 저렴하고 빠른 모델이면 충분합니다.
pt: Basta um modelo barato e rápido.
ru: Хватит дешёвой и быстрой модели.
tr: Ucuz, hızlı bir model yeterli.
ur: ایک سستا، تیز ماڈل کافی ہے۔
vi: Một mô hình rẻ, nhanh là đủ.
zh_hans: 便宜、快的模型就够了。
